--------------------------------------------------------------------------------
-- /////////////////////////////////////////////////////////////////////////////
--------------------------------------------------------------------------------
 
module Main where

--------------------------------------------------------------------------------
-- import E_DLists
-- import E_Lexers 
-- import E_Yi

--------------------------------------------------------------------------------

-- import RS_Main
-- import RS_Benchmark
-- import RS_Killer
-- import RS_RandomMonad
-- import RS_ListLib
-- import RS_IntExts
-- import RS_MergeSort
-- import RS_TestData
-- import RS_LibBase
-- import RS_RandomLib
--------------------------------------------------------------------------------
-- import HT_FileRead
-- import PF_Collection 

--------------------------------------------------------------------------------
-- import Literal
import Main_Test
--import Listing10

-- Пример из орисания компилятора "8.2.1 Using foreign ..."
-- foreign export ccall foo :: Int -> IO Int

-- foo :: Int -> IO Int
-- foo n = return (length (f n))

-- f :: Int -> [Int]
-- f 0 = []
-- f n = n:(f (n-1))

--------------------------------------------------------------------------------

main = do 
--     putStr ("\n")
     main_test
--    listing10_main
--     ralf_main

--     putStr ((show sorter) ++ "\n")
-- time cmd
--     time test_sorts

    --putStr ((show chanceWin) ++ "\n")
--------------------------------------------------------------------------------
--     putStr ((show deck) ++ "\n")
--     putStr ("\n")
--------------------------------------------------------------------------------
    --chanceWin

--     main_fileread

--     putStr ("\n")
--  main_test
--  putStr ("\n")
--------------------------------------------------------------------------------
-- /////////////////////////////////////////////////////////////////////////////
--------------------------------------------------------------------------------
